r4d10n/hx-esp32-cam-fpv/esp32-gs/sdkconfig.defaults
# ESP32 FPV Ground Station SDK Configuration Defaults

# Target ESP32-S3 by default
CONFIG_IDF_TARGET="esp32s3"

# WiFi Configuration
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_RX_BA_WIN=16
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=y
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=y

# Enable promiscuous mode
CONFIG_ESP_WIFI_ENABLE_PROMISCUOUS=y

# Increase task watchdog timeout
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# PSRAM disabled - use internal RAM only
# Set to y to enable PSRAM on boards that have it
CONFIG_SPIRAM=n

# HTTP Server
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_HTTPD_WS_SUPPORT=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Compiler optimizations
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# NVS
CONFIG_NVS_ENCRYPTION=n

# USB Network (CDC+NCM Composite) Configuration
# Console on UART (frees USB OTG for TinyUSB CDC+NCM composite)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_USB_CDC=n
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=n
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# USB OTG Hardware
CONFIG_USB_OTG_SUPPORTED=y

# TinyUSB Configuration (CDC+NCM+UVC composite device)
CONFIG_TINYUSB_ENABLED=y
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1
CONFIG_TINYUSB_NET_MODE_NCM=y
CONFIG_TINYUSB_DESC_CUSTOM_VID=0x303A
CONFIG_TINYUSB_DESC_CUSTOM_PID=0x4000
CONFIG_TINYUSB_DESC_MANUFACTURER_STRING="ESP32-FPV"
CONFIG_TINYUSB_DESC_PRODUCT_STRING="FPV Ground Station"

# TinyUSB Video Class (UVC) Configuration
CONFIG_TINYUSB_VIDEO_ENABLED=y
CONFIG_TINYUSB_VIDEO_STREAMING=y

# USB Network IP Configuration (different subnet from WiFi AP 192.168.4.x)
CONFIG_USB_NETIF_DEFAULT_IP="192.168.7.1"
CONFIG_USB_NETIF_DEFAULT_GATEWAY="192.168.7.1"
CONFIG_USB_NETIF_DEFAULT_NETMASK="255.255.255.0"

# Enable USB networking in FPV GS
CONFIG_FPV_GS_ENABLE_USB_NET=y

# Enable USB UVC (webcam) in FPV GS
CONFIG_FPV_GS_ENABLE_USB_UVC=y
CONFIG_FPV_GS_UVC_WIDTH=640
CONFIG_FPV_GS_UVC_HEIGHT=480
CONFIG_FPV_GS_UVC_FPS=15
CONFIG_FPV_GS_UVC_BULK_MODE=n
CONFIG_FPV_GS_UVC_DEFAULT_ACTIVE=n
